---
layout: default
title: Си. Циклы for.
---

# Си. Циклы `for`.

## Квадрат

### Задача
Получите от пользователя неотрицательное целое число `n`, не более 23. Используйте вложенные циклы для печати квадрата n-на-n с использованием хэшей (`#`) в командной строке.

Пример вывода:
```
./square
Give me a number between 1 and 23: 3
###
###
###
```

### Distribution Code
Нет

***

## Мое пространство

### Задача
Напишите программу, которая запрашивает у пользователя сообщение, а затем выводит это сообщение с его первой заглавной буквой, a чередовать маленькие и заглавные в соответствии с приведенным ниже образцом. Для простоты вы можете предположить, что пользователь будет вводить только строчные буквы и пробелы.

Пример вывода:
```
./myspace
thanks for the add
ThAnKs FoR tHe AdD
```

### Distribution Code
```c
#include <cs50.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>

int main (void)
{
    //TODO
}
```

***

## Кратные числа

### Задача
Возьмите в качестве входного числа число от 1 до 100. Используйте цикл `for` для печати каждого кратного этого числа от 1 до 100 (включительно).

Пример вывода:
```
./multiples
Give me a number between 1 and 100: 5
5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100
```

### Distribution Code
Нет

***

## Преобразование цикла `for`

### Задача
Перепишите программу ниже с двойного цикла на одинарный. Убедитесь, что переписанная программа выводит тоже самое, что и изначальная программа.

### Distribution Code
```c
#include <cs50.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>

int main (void)
{
    for (int i = 0; i < 5; i++)
        for (int j = 0; j < 5; j++)
            printf("i = %d, j = %d\n", i, j);
}
```